# Напишите функцию hello_world, которая будет печать приветственную
# строку «Hello World».

def hello_world():
	print('Hello World')

hello_world()
