print(((67 + 33) * (25 - 20)) / 25)    # нахождение x

mtx=[[l1, l2, l3], [j1, j2, j3], [k1, k2, k3]]   # матрица

matrix = [[1, 2, 3, 4, 5], [6, 7, 8, 9, 10], [11, 12, 13, 14, 15], [16, 17, 18, 19, 20], [21, 22, 23, 24, 25]]
matrix[3][1] = 6            # замена 17 на 6
print(matrix)

a1 = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9}
a2 = {1, 2}
a3 = {6, 7, 8}
a4 = {1}
a5 = {3, 4, 5, 6}

print(a2 | a4)                 # результат объединения a2 и a4
print(a1 - a5)                 # разница между a1 и a5
print(a2 ^ a3)                 # симметричная разница между a2 и a3
print(a1 & a2 & a3 & a4 & a5)  # пересечение всех множеств
