"""
Напишите функцию, печатающую информацию о приоритетной задаче в формате:
"Задача №1 в приоритете"
"""


def show():  # выводим приоритетную задачу
    print("Задача №%d в приоритете" % (queue[head]))
